{
    "items": [
        {
            "date": "2018-07-10",
            "source": "blog",
            "title": "Rescue from Ellisons, A Major Account from a Minor Contributor — Part 1",
            "original_url": "http://www.ryanrodd.com/rescue.html",
            "context": "Opening of a personal narrative blog post about a complex cave rescue, giving background on cave rescue, Ellison's Cave, and the author's motivation.",
            "topic": "cave rescue; background; personal perspective; risk; environment",
            "tone": ["narrative", "introspective", "informative"],
            "content": "Rescue from Ellisons, A Major Account from a Minor Contributor\nPublished by Ryan on July 10, 2018\n\nFormatted and re-published from the original account in May 2013. Feel free to read it here. Photos from NCRC mock cave rescue event.\n\nThe following account contains details about a recent and complex rescue event. Information about the patient, and prevailing medical and operational details contained herein have already been released by official channels to press and media. Any further info will have to wait until our next campfire story time, and after responding agencies have made an official report.\n\n\nOur crew at an NCRC mock rescue. Credit: Ryan Rodd\n\nSome Perspective\nCave rescues are harrowing tales and I’ve had the privilege to hear a great many, both thrilling and tragic. Last year, I made the (excellent) decision to take a cave rescue seminar held by the National Cave Rescue Commission (NCRC) and the NSS. To date the NCRC provides one of the few regulated caving-related training programs in the World.\n\nMy goal was to enrich my own experience and in doing so, be safer about introducing my friends to this sporting hobby. Though inaccessible and sometimes dangerous, caves are some of the most fascinating places on Earth, with environments and features that only a small fraction of people get to experience before they die.\n\nPerhaps one of the most inaccessible of these places is the labyrinth of passages that makes up the bottom section of Ellison’s cave. Ellison’s cave is notably one of the deepest caves in the world and features the deepest unobstructed pits in the United States. If I had to make a list of places to not be stranded or injured, a cave like Ellisons would be very near the top, maybe outranked by outer space or the inside of a volcano.\n\nMore on Ellisons: 2011 Trip Report | 2012 Trip Report"
        },
        {
            "date": "2018-07-10",
            "source": "blog",
            "title": "Rescue from Ellisons, A Major Account from a Minor Contributor — Part 2",
            "original_url": "http://www.ryanrodd.com/rescue.html",
            "context": "The initial rescue call, the fast gear-up and drive from Atlanta, and speculative scenario-building about the situation underground.",
            "topic": "emergency call; uncertainty; preparation; scenario planning",
            "tone": ["narrative", "anticipatory"],
            "content": "The Call\nAt around 8am on Memorial Day (5/27) I’m awoken by my phone, confused that a good friend and fellow caver Will Urbanski would be calling so early. Ready to hear to some crazy new idea, or be invited on an impromptu caving adventure, I listened groggily. The information I was able to digest was sparse but all I needed to fly out of bed: ongoing cave rescue… Ellisons… Bottom rescue… all hands on deck. In 15 minutes my gear was packed (cue applause) and I’m jumping into Will’s SUV. The drive from Atlanta to Lafayette will take just under 2 hours. I grab some of my NCRC material to start catching up (as if).\n\n\nFantastic Pit in Ellisons is a 586′ free fall\n\nThe Scenario\nThe 2 hour drive is enough to build a giant dossier of speculation about what to expect from the rescue scene. Will had been caving in TAG with Andy Zellner and Kyle Gochenour the previous day and was aware that the initial call for rescue actually went out around 8pm the night before. That means 12 hours had already passed before we got the second call for more rescuers. This time, the call came from Brad Tipton, captain of Hamilton Co. cave rescue who was flying all the way back from Colorado to assist.\n\nBeing a holiday weekend, many local cavers and rescue team members were out of town. Combined with the fact that many other cavers may be unwilling to negotiate a cave as difficult as Ellisons, we concluded that resources for the rescue could be strained.\n\nThe information we had on the patient was that he suffered a compound fracture of the leg and when we departed Atlanta, was still with rescuers at the bottom of the cave. This meant in the worst case he is still at the initial site of the incident, or in the best case ready to be hoisted up Fantastic pit. Considering the severity of the cave in between, the variability between those two scenarios was immense."
        },
        {
            "date": "2018-07-10",
            "source": "blog",
            "title": "Rescue from Ellisons, A Major Account from a Minor Contributor — Part 3",
            "original_url": "http://www.ryanrodd.com/rescue.html",
            "context": "Arrival at incident command, description of the rescue infrastructure and patient status, and detailed recounting of how the accident occurred and the initial first aid.",
            "topic": "incident command; rescue logistics; accident description; first response",
            "tone": ["narrative", "technical", "respectful"],
            "content": "The Arrival\nBeing 14 hours into the rescue, we arrived to an extremely busy yet precisely coordinated ground operation at the base of pigeon mountain. Incident command was set up at the blue hole surrounded by the fully deployed vehicle and rescue equipment strength of Hamilton Rescue and other TAG agencies. Cave rescue vets including Allen Padgett, Buddy Lane and Patricia Springer had a complete rundown and tasks ready for us. More than 90 rescuers had already shown up and the patient was remarkably already being brought up Fantastic pit by an incredibly elaborate haul system (we learned later: comprised of a counter-balance and flying rebelay). Brad mentioned afterwards that this was a system Hamilton Co rescue had been practicing only weeks before.\n\nThe patient at the time was alive, but declining as he had suffered a head injury during his fall and there was postural indication of brain swelling. The leg injury turned out to be a compound fracture of the femur accompanied by substantial blood loss. Amazingly, three pints of blood had been delivered via life flight helicopter early in the morning and brought to and administered to the patient by paramedics deep in the cave.\n\nThe exhausting hike up to the cave entrance usually takes an hour and involves lugging a lot of heavy gear uphill. At noon, with orders in hand, we shuttle quickly via 4WD gator from the blue hole to the mouth of the cave and entrance control. At entrance control we learned over the comms that the patient has cleared the top of Fantastic pit and the litter is being moved to the bottom of the Warm Up pit and thus the mouth of the cave. For rescue out of such a technical cave, this progress was astounding.\n\n\nUnreeling communication wire into the cave during a mock rescue. Credit: Ryan Rodd\n\nAt the entrance of the cave we met Andy Zellner who emerged having just spent 12 hours underground. Living nearby, Andy was the first on the scene and the very first responder to reach the patient once the 911 call went out. He sat with us for a bit and described the incident scene.\n\nAt the time Dwight (the patient) and friends were executing a cross-over or through-trip in Ellisons. This involves rappelling into one side of the cave, travelling the entire bottom portion and climbing out the other side. When Dwight slipped, he was negotiating a handline assisted climb down (most cavers know this kind of sketchiness) in the bottom passages. Dwight fell, rolled and fell again, out of sight a total of 40-50 feet. He was immediately unresponsive according to the friends that were accompanying him. Little did they know at the time, Dwight had fallen not into a tight crack, but into a lower and wider section of main passage full of rock shale and breakdown. After calling down to him, one friend raced to the surface while the other two stayed behind to find Dwight and attempt first aid. Andy mentioned that when he arrived to the incident scene, the friends had found the patient and were administering first aid that likely saved his life."
        },
        {
            "date": "2018-07-10",
            "source": "blog",
            "title": "Rescue from Ellisons, A Major Account from a Minor Contributor — Part 4",
            "original_url": "http://www.ryanrodd.com/rescue.html",
            "context": "Final phases of the rescue, emotional impact of seeing the patient, derigging and cleanup, exit from the cave, and reflective gratitude toward the rescue community.",
            "topic": "rescue outcome; emotional impact; debrief; gratitude; community",
            "tone": ["narrative", "reflective", "grateful"],
            "content": "The Rescue\nMany of the details provided are hearsay. The rescue ongoing 12 hours before we even arrived had made astounding progress and contained therein are stories far more interesting and harrowing than my own. As Andy finished his tales and got a ride down to incident command for some well deserved rest, we heard over comms that the patient had been hauled up the last pit (Warm Up) and was being attended by a physician, CHCRS Team Doctor David Wharton, MD.\n\nThe last stretch of cave, 300 yards of easy stream passage were all that separated the hearsay from experience. It became clear that Will, Marty Abercrombie and I were needed as the surface team to the haul litter and patient out of the cave and up the hill to an awaiting police SUV.\n\nFor a second this seemed unfair, 80 people inside Ellisons worked 14 hours for this moment… pulling this injured soul from the dark, inaccessible confines of the Earth and into the free and open world. We just show up and that gets to be our job. Knowing the litter was making its final move, Will stationed at the mouth of the cave peering into the dark passage, entrance control and incident command at the ready. A few tense moments pass when we hear the rescue crew. Entrance control heralds verbal confirmation, then Will sees their headlamps. Entrance control radios visual confirmation.\n\n\nPassing a patient through a constriction during a mock rescue. Credit: Ryan Rodd\n\nAs the litter approaches and then gets passed to us through the constricted cave opening, I feel the familiar handle of a ferno. Contained within the ferno is standard packaging; vapor barrier, blankets, one inch tubular webbing, cervical brace, stethoscope & blood pressure cuff, and the patient. As my eyes cross over the patient’s face, I took a sudden breath and held it. Before me was the face of an unconscious, middle aged man, eyes shut, both black and swollen, head slightly to the side, face bloodied and lacerated.\n\nIn a moment of clarity, it finally hit me that this wasn’t an exercise, not another mock-rescue, not the smiling face of a friend pretending to be a rescue patient, but the real thing. Dwight was laying on the stretcher in front of me, his status declining, having been injured and extracted from one of the world’s deepest caves. Suddenly there was no sense of pride, fairness or victory, just the overwhelming need to complete the task at hand: to get Dwight out of the cave and up the hill through the brush and into the awaiting SUV as quickly as possible.\n\nThe Cleanup\nThe directive was clear and quickly executed. Once the patient was loaded up and driven off, Will, Marty and I head back down to the cave entrance for bitter work. As exhausted rescuers begin to flow out, there is still the job of reclaiming over 1000 lbs of ropes and rescue gear from the depths of the cave, rolling up comm wire and erasing our tracks.\n\nThankfully crews at the top and bottom of Fantastic pit (deeper into the cave) were already derigging and packing while the remnant rescuers made their own long climbs out. Will, Micha Lane and I were stationed at the top of warm up to help haul gear (and applaud emerging rescuers) for a few hours until the call for deeper assistance came through.\n\nWhen it did, after quickly putting on our vertical gear, we rappel down Warm-Up pit to make our way to the attic (top of Fantastic pit). Its clear we won’t be needed any further into the cave, however multiple ropes, rescue gear and a fully packed SKED still need to make their way out. Along with the other rescuers we form an impromptu bucket brigade… the heaviest gear being passed between obstacles and down the small nuisance (elevator) drop for an expedited trip to the Warm Up pit haul points.\n\nThe Exit\n\nAttending the patient in the cave during an NCRC mock rescue. Credit: Ryan Rodd\n\nIn a short hour, rescuers and gear are stationed at the bottom of warm-up. The deepest and most dangerous parts of the cave now quiet, abnegated to peaceful darkness. Two ropes are dropped into the 125 ft, dark, misty pit for hauling gear and making the last climb to the upper passage, but with 30 of us still at the bottom, its clear another rope would be useful.\n\nWill and I decide to wait our turns to climb, allowing the more weary and spent rescuers first access to the surface. Pulling out his camp stove, Will begins to make warm coffee for rescuers at the bottom of the dark pit. Its accepted by a few welcoming hands while passing around trail mix and regaling ourselves with the tales of the day passed.\n\nFinally its time for the last few climbers out of the pit. At the top of Warm Up we meet team rescue captain Brad Tipton, fresh off a plane from Colorado who is astounded by the speed of the rescue team and swearing he thought the operation would take many more hours. The remaining rescuers make the trek down the final passage of the cave, while I pack my vertical gear away and talk to Brad. He reports that after being airlifted to Erlanger hospital in Chattanooga, doctors believe Dwight will survive and recover from the incident.\n\nA slow, final and fulfilling walk later we emerge from Ellison’s with entrance control declaring last-out at 6:48pm. With the high sun beginning to set, and a quick thought to my week ahead, I can’t help but think how amazing and lucky my first rescue experience has been (even though I probably didn’t need to be there).\n\nWhat remains with me now is how fortunate I am to know these people, fellow cavers who at beckoned call plunge 1000 feet into danger and darkness to save a stricken soul. With training and experience I hope I’ll never find myself needing to be rescued – but if I do I pray to God its in a TAG cave among these amazing and exceptional human beings.\n\nA special shout out to my friends involved in this rescue. Thanks for everything. Hope to cave with you guys again soon: Andy Zellner, Kyle Gochenour, Mark and Shannon Whitmer, Michael Hopkins, the Lane Family (Buddy, Doranne, Micha), Will Urbanski, Marty Abercrombie, Allen Padgett, Tim White, Lane Outz, Brad Tipton who am I forgetting? A lot of you. Love you all."
        }
    ]
}